# GetProjectBasePoint Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BasePoint..::..GetProjectBasePoint Method
BasePoint Class See Also
---
Gets the project base point for the document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.2
# Syntax
C#
---
```text
public static BasePoint GetProjectBasePoint(
	Document cda
)
```

Visual Basic
---
```text
Public Shared Function GetProjectBasePoint ( _
	cda As Document _
) As BasePoint
```

Visual C++
---
```text
public:
static BasePoint^ GetProjectBasePoint(
	Document^ cda
)
```

# ### Parameters
cda
    Type: Autodesk.Revit.DB..::..Document The document from which to get the project base point.
# ### Return Value
The project base point of the document.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
BasePoint Class
Autodesk.Revit.DB Namespace